[
    {
        "title": "Google: Over 57 Nation-State Threat Groups Using AI for Cyber Operations",
        "link": "https://thehackernews.com/2025/01/google-over-57-nation-state-threat.html?m=1",
        "content": "Over 57 distinct threat actors with ties to China, Iran, North Korea, and Russia have been observed using artificial intelligence (AI) technology powered by Google to further enable their malicious cyber and information operations.  \"Threat actors are experimenting with Gemini to enable their operations, finding productivity gains but not yet developing novel capabilities,\" Google Threat Intelligence Group (GTIG) said  in a new report. \"At present, they primarily use AI for research, troubleshooting code, and creating and localizing content.\"  Government-backed attackers, otherwise known as Advanced Persistent Threat (APT) groups, have sought to use its tools to bolster multiple phases of the attack cycle, including coding and scripting tasks, payload development, gathering information about potential targets, researching publicly known vulnerabilities, and enabling post-compromise activities, such as defense evasion.   Describing Iranian APT actors as the \"he..."
    },
    {
        "title": "Authorities Seize Domains of Popular Hacking Forums in Major Cybercrime Crackdown",
        "link": "https://thehackernews.com/2025/01/authorities-seize-domains-of-popular.html?m=1",
        "content": "An international law enforcement operation has dismantled the domains associated with various online platforms linked to cybercrime such as Cracked, Nulled, Sellix, and StarkRDP.  The effort has targeted the following domains -   www.cracked.io  www.nulled.to  www.mysellix.io  www.sellix.io  www.starkrdp.io   Visitors to these websites are now greeted by a seizure banner that says they were confiscated as part of Operation Talent that involved authorities from Australia, France, Greece, Italy, Romania, Spain, and the United States, along with Europol.  \"This website, as well as the information on the customers and victims of the website, has been seized by international law enforcement partners,\" the message reads.   Both Nulled and Cracked have been used to peddle  various hack tools, such as ScrubCrypt, a malware obfuscation engine that has been observed delivering stealer malware in the past.  The maintainers of Cracked confirmed  the development on their Telegram channel..."
    },
    {
        "title": "Lightning AI Studio Vulnerability Allowed RCE via Hidden URL Parameter",
        "link": "https://thehackernews.com/2025/01/lightning-ai-studio-vulnerability.html?m=1",
        "content": "Cybersecurity researchers have disclosed a critical security flaw in the Lightning AI Studio  development platform that, if successfully exploited, could allow for remote code execution.  The vulnerability, rated a CVSS score of 9.4, enables \"attackers to potentially execute arbitrary commands with root privileges\" by exploiting a hidden URL parameter, application security firm Noma said  in a report shared with The Hacker News.  \"This level of access could hypothetically be leveraged for a range of malicious activities, including the extraction of sensitive keys from targeted accounts,\" researchers Sasi Levi, Alon Tron, and Gal Moyal said.  The issue is embedded in a piece of JavaScript code that could facilitate unfettered access to a victim's development environment, as well as run arbitrary commands on an authenticated target in a privileged context.  Noma said it found a hidden parameter called \"command\" in user-specific URLs – e.g., \"lightn..."
    },
    {
        "title": "SOC Analysts - Reimagining Their Role Using AI",
        "link": "https://thehackernews.com/2025/01/soc-analysts-reimagining-their-role.html?m=1",
        "content": "The job of a SOC analyst has never been easy. Faced with an overwhelming flood of daily alerts, analysts (and sometimes IT teams who are doubling as SecOps) must try and triage thousands of security alerts—often false positives—just to identify a handful of real threats. This relentless, 24/7 work leads to alert fatigue, desensitization, and increased risk of missing critical security incidents. Studies show that 70% of SOC analysts experience severe stress, and 65% consider leaving their jobs within a year . This makes retention a major challenge for security teams, especially in light of the existing shortage of skilled security analysts .  On the operational side, analysts spend more time on repetitive, manual tasks like investigating alerts, and resolving and documenting incidents than they do on proactive security measures. Security teams struggle with configuring and maintaining SOAR playbooks as the cyber landscape rapidly changes. To top this all off, tool overload and siloed ..."
    },
    {
        "title": "DeepSeek AI Database Exposed: Over 1 Million Log Lines, Secret Keys Leaked",
        "link": "https://thehackernews.com/2025/01/deepseek-ai-database-exposed-over-1.html?m=1",
        "content": "Buzzy Chinese artificial intelligence (AI) startup DeepSeek , which has had a meteoric rise in popularity in recent days, left one of its databases exposed on the internet, which could have allowed malicious actors to gain access to sensitive data.  The ClickHouse database \"allows full control over database operations, including the ability to access internal data,\" Wiz security researcher Gal Nagli said .  The exposure also includes more than a million lines of log streams containing chat history, secret keys, backend details, and other highly sensitive information, such as API Secrets and operational metadata. DeepSeek has since plugged the security hole following attempts by the cloud security firm to contact them.   The database, hosted at oauth2callback.deepseek[.]com:9000 and dev.deepseek[.]com:9000, is said to have enabled unauthorized access to a wide range of information. The exposure, Wiz noted, allowed for complete database control and potential privilege escalati..."
    },
    {
        "title": "Unpatched PHP Voyager Flaws Leave Servers Open to One-Click RCE Exploits",
        "link": "https://thehackernews.com/2025/01/unpatched-php-voyager-flaws-leave.html?m=1",
        "content": "Three security flaws have been disclosed in the open-source PHP package Voyager  that could be exploited by an attacker to achieve one-click remote code execution on affected instances.  \"When an authenticated Voyager user clicks on a malicious link, attackers can execute arbitrary code on the server,\" Sonar researcher Yaniv Nizry said  in a write-up published earlier this week.   The identified issues, which remain unpatched to date despite responsible disclosure on September 11, 2024, are listed below -   CVE-2024-55417 - An arbitrary file write vulnerability in the \"/admin/media/upload\" endpoint  CVE-2024-55416 - A reflected cross-site scripting (XSS) vulnerability in the \"/admin/compass\" endpoint  CVE-2024-55415 - An arbitrary file leak and deletion vulnerability    A malicious attacker could leverage Voyager's media upload feature to upload a malicious file in a manner that bypasses MIME type verification, and make use of a polyglot file  that ap..."
    },
    {
        "title": "Discover Hidden Browsing Threats: Free Risk Assessment for GenAI, Identity, Web, and SaaS Risks",
        "link": "https://thehackernews.com/2025/01/discover-hidden-browsing-threats-free.html",
        "content": "As GenAI tools and SaaS platforms become a staple component in the employee toolkit, the risks associated with data exposure, identity vulnerabilities, and unmonitored browsing behavior have skyrocketed. Forward-thinking security teams are looking for security controls and strategies to address these risks, but they do not always know which risks to prioritize. In some cases, they might have blind spots into the existence of risks. To help, a new complimentary risk assessment is now available. The assessment will be customized for each organization's browsing environment, evaluating their risk and providing actionable insights. Security and IT teams can leverage the assessment to strengthen their security posture, inform their decision-making, evangelize across the organization, and plan next steps. The assessment results in a report that includes a high-level overview of key risks, including insecure use of gen AI, sensitive data leakage risks through the browser, SaaS app usage, ..."
    },
    {
        "title": "New Aquabot Botnet Exploits CVE-2024-41710 in Mitel Phones for DDoS Attacks",
        "link": "https://thehackernews.com/2025/01/new-aquabot-botnet-exploits-cve-2024.html?m=1",
        "content": "A Mirai botnet  variant dubbed Aquabot  has been observed actively attempting to exploit a medium-severity security flaw impacting Mitel phones in order to ensnare them into a network capable of mounting distributed denial-of-service (DDoS) attacks.  The vulnerability in question is CVE-2024-41710  (CVSS score: 6.8), a case of command injection in the boot process that could allow a malicious actor to execute arbitrary commands within the context of the phone.  It affects Mitel 6800 Series, 6900 Series, 6900w Series SIP Phones, and Mitel 6970 Conference Unit. It was addressed  by Mitel in mid-July 2024. A proof-of-concept (PoC) exploit for the flaw became publicly available  in August.   Outside of CVE-2024-41710, some of the other vulnerabilities targeted by the botnet include CVE-2018-10561, CVE-2018-10562, CVE-2018-17532, CVE-2022-31137, CVE-2023-26801, and a remote code execution flaw targeting Linksys E-series devices.   \"Aquabot is a botnet that was built off the Mirai fram..."
    },
    {
        "title": "Lazarus Group Uses React-Based Admin Panel to Control Global Cyber Attacks",
        "link": "https://thehackernews.com/2025/01/lazarus-group-uses-react-based-admin.html?m=1",
        "content": "The North Korean threat actor known as the Lazarus Group  has been observed leveraging a \"web-based administrative platform\" to oversee its command-and-control (C2) infrastructure, giving the adversary the ability to centrally supervise all aspects of their campaigns.  \"Each C2 server hosted a web-based administrative platform, built with a React application and a Node.js API,\" SecurityScorecard's STRIKE team said in a new report  shared with The Hacker News. \"This administrative layer was consistent across all the C2 servers analyzed, even as the attackers varied their payloads and obfuscation techniques to evade detection.\"   The hidden framework has been described as a comprehensive system and a hub that allows attackers to organize and manage exfiltrated data, maintain oversight of their compromised hosts, and handle payload delivery.  The web-based admin panel has been identified in connection with a supply chain attack campaign dubbed Operation ..."
    },
    {
        "title": "AI in Cybersecurity: What's Effective and What's Not – Insights from 200 Experts",
        "link": "https://thehackernews.com/2025/01/ai-in-cybersecurity-whats-effective-and.html?m=1",
        "content": "Curious about the buzz around AI in cybersecurity? Wonder if it's just a shiny new toy in the tech world or a serious game changer? Let's unpack this together in a not-to-be-missed webinar  that goes beyond the hype to explore the real impact of AI on cybersecurity.  Join Ravid Circus , a seasoned pro in cybersecurity and AI, as we peel back the layers of AI in cybersecurity through a revealing survey of 200 industry insiders. This isn't your average tech talk; it's a down-to-earth, insightful discussion about what AI is actually doing for us today.  Why Tune In?   Get the Inside Scoop:  How are real-world security teams using AI right now? Learn about the genuine perks and the real snags, from data hiccups to transparency troubles.  Boost Your Cyber Defenses:  Discover which cybersecurity corners AI is revolutionizing the most. It's about pinpointing where AI can really beef up your security measures.  Walk Away With a Game Plan:  This isn't just about high-level idea..."
    },
    {
        "title": "New SLAP & FLOP Attacks Expose Apple M-Series Chips to Speculative Execution Exploits",
        "link": "https://thehackernews.com/2025/01/new-slap-flop-attacks-expose-apple-m.html?m=1",
        "content": "A team of security researchers from Georgia Institute of Technology and Ruhr University Bochum has demonstrated two new side-channel attacks targeting Apple silicon that could be exploited to leak sensitive information from web browsers like Safari and Google Chrome.  The attacks have been codenamed  Data Speculation Attacks via Load Address Prediction on Apple Silicon ( SLAP ) and Breaking the Apple M3 CPU via False Load Output Predictions ( FLOP ). Apple was notified of the issues in May and September 2024, respectively.  The vulnerabilities, like the previously disclosed iLeakage  attack, build on Spectre , arising when speculative execution \"backfires,\" leaving traces of mispredictions in the CPU's microarchitectural state and the cache.   Speculative execution refers to a performance optimization mechanism in modern processors that are aimed at predicting the control flow the CPU should take and execute instructions along the branch beforehand.  In the event of a mi..."
    },
    {
        "title": "How Interlock Ransomware Infects Healthcare Organizations",
        "link": "https://thehackernews.com/2025/01/how-interlock-ransomware-infects.html?m=1",
        "content": "Ransomware attacks have reached an unprecedented scale in the healthcare sector, exposing vulnerabilities that put millions at risk. Recently, UnitedHealth revealed that 190 million Americans had their personal and healthcare data stolen during the Change Healthcare ransomware attack, a figure that nearly doubles the previously disclosed total.   This breach shows just how deeply ransomware can infiltrate critical systems, leaving patient trust and care hanging in the balance.  One of the groups that targets this already fragile sector is the Interlock ransomware group. Known for their calculated and sophisticated attacks, they focus on hospitals, clinics, and other medical service providers.  Interlock Ransomware Group: An Active Threat to Healthcare  The Interlock ransomware group is a relatively recent but dangerous player in the world of cybercrime, known for employing double-extortion tactics.   This method involves encrypting a victim's data to disrupt operations and th..."
    },
    {
        "title": "CISA and FDA Warn of Critical Backdoor in Contec CMS8000 Patient Monitors",
        "link": "https://thehackernews.com/2025/01/cisa-and-fda-warn-of-critical-backdoor.html?m=1",
        "content": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) and the Food and Drug Administration (FDA) have issued alerts about the presence of hidden functionality in Contec CMS8000 patient monitors  and Epsimed MN-120 patient monitors.  The vulnerability , tracked as CVE-2025-0626 , carries a CVSS v4 score of 7.7 on a scale of 10.0. The flaw, alongside two other issues, was reported to CISA by an anonymous external researcher.  \"The affected product sends out remote access requests to a hard-coded IP address, bypassing existing device network settings to do so,\" CISA said  in an advisory. \"This could serve as a backdoor and lead to a malicious actor being able to upload and overwrite files on the device.\"   \"The reverse backdoor provides automated connectivity to a hard-coded IP address from the Contec CMS8000 devices, allowing the device to download and execute unverified remote files. Publicly available records show that the IP address is not associa..."
    },
    {
        "title": "Top 5 AI-Powered Social Engineering Attacks",
        "link": "https://thehackernews.com/2025/01/top-5-ai-powered-social-engineering.html?m=1",
        "content": "Social engineering has long been an effective tactic because of how it focuses on human vulnerabilities. There's no brute-force 'spray and pray' password guessing. No scouring systems for unpatched software. Instead, it simply relies on manipulating emotions such as trust, fear, and respect for authority, usually with the goal of gaining access to sensitive information or protected systems.  Traditionally that meant researching and manually engaging individual targets, which took up time and resources. However, the advent of AI has now made it possible to launch social engineering attacks  in different ways, at scale, and often without psychological expertise. This article will cover five ways that AI is powering a new wave of social engineering attacks.  The audio deepfake that may have influenced Slovakia elections  Ahead of Slovakian parliamentary elections in 2023, a recording emerged that appeared to feature candidate Michal Simecka in conversation with a well-known journalist, M..."
    },
    {
        "title": "Italy Bans Chinese DeepSeek AI Over Data Privacy and Ethical Concerns",
        "link": "https://thehackernews.com/2025/01/italy-bans-chinese-deepseek-ai-over.html?m=1",
        "content": "Italy's data protection watchdog has blocked  Chinese artificial intelligence (AI) firm DeepSeek's service within the country, citing a lack of information on its use of users' personal data.  The development comes days after the authority, the Garante, sent a series of questions  to DeepSeek, asking about its data handling practices and where it obtained its training data.  In particular, it wanted to know what personal data is collected by its web platform and mobile app, from which sources, for what purposes, on what legal basis, and whether it is stored in China.  In a statement issued January 30, 2025, the Garante said it arrived at the decision after DeepSeek provided information that it said was \"completely insufficient.\"  The entities behind the service, Hangzhou DeepSeek Artificial Intelligence, and Beijing DeepSeek Artificial Intelligence, have \"declared that they do not operate in Italy and that European legislation does not apply to them,\" i..."
    },
    {
        "title": "Google Bans 158,000 Malicious Android App Developer Accounts in 2024",
        "link": "https://thehackernews.com/2025/01/google-bans-158000-malicious-android.html?m=1",
        "content": "Google said it blocked over 2.36 million policy-violating Android apps from being published to the Google Play app marketplace in 2024 and banned more than 158,000 bad developer accounts that attempted to publish such harmful apps.  The tech giant also noted it prevented 1.3 million apps from getting excessive or unnecessary access to sensitive user data during the time period by working with third-party app developers.  Furthermore, Google Play Protect, a security feature  that's enabled by default on Android devices to flag novel threats, identified 13 million new malicious apps from outside of the official app store.  \"As a result of partnering closely with developers, over 91% of app installs on the Google Play Store now use the latest protections of Android 13 or newer,\" Bethel Otuteye and Khawaja Shams from the Android Security and Privacy Team, and Ron Aquino from Google Play Trust and Safety said .  In comparison, the company blocked 1.43 million  and 2.28 millio..."
    },
    {
        "title": "Broadcom Patches VMware Aria Flaws – Exploits May Lead to Credential Theft",
        "link": "https://thehackernews.com/2025/01/broadcom-patches-vmware-aria-flaws.html?m=1",
        "content": "Broadcom has released  security updates to patch five security flaws impacting VMware Aria Operations and Aria Operations for Logs, warning customers that attackers could exploit them to gain elevated access or obtain sensitive information.  The list of identified flaws, which impact versions 8.x of the software, is below -   CVE-2025-22218  (CVSS score: 8.5) - A malicious actor with View Only Admin permissions may be able to read the credentials of a VMware product integrated with VMware Aria Operations for Logs  CVE-2025-22219  (CVSS score: 6.8) - A malicious actor with non-administrative privileges may be able to inject a malicious script that may lead to arbitrary operations as admin user via a stored cross-site scripting (XSS) attack  CVE-2025-22220  (CVSS score: 4.3) - A malicious actor with non-administrative privileges and network access to Aria Operations for Logs API may be able to perform certain operations in the context of an admin user  CVE-2025-22221  (CVSS score: 5.2) ..."
    },
    {
        "title": "Lightning AI Studio Vulnerability Could've Allowed RCE via Hidden URL Parameter",
        "link": "https://thehackernews.com/2025/01/lightning-ai-studio-vulnerability.html?m=1",
        "content": "Cybersecurity researchers have disclosed a critical security flaw in the Lightning AI Studio  development platform that, if successfully exploited, could have allowed for remote code execution.  The vulnerability, rated a CVSS score of 9.4, enables \"attackers to potentially execute arbitrary commands with root privileges\" by exploiting a hidden URL parameter, application security firm Noma said  in a report shared with The Hacker News.  \"This level of access could hypothetically be leveraged for a range of malicious activities, including the extraction of sensitive keys from targeted accounts,\" researchers Sasi Levi, Alon Tron, and Gal Moyal said.  The issue is embedded in a piece of JavaScript code that could facilitate unfettered access to a victim's development environment, as well as run arbitrary commands on an authenticated target in a privileged context.  Noma said it found a hidden parameter called \"command\" in user-specific URLs – e.g., ..."
    },
    {
        "title": "U.S. and Dutch Authorities Dismantle 39 Domains Linked to BEC Fraud Network",
        "link": "https://thehackernews.com/2025/02/us-and-dutch-authorities-dismantle-39.html?m=1",
        "content": "U.S. and Dutch law enforcement agencies have announced that they have dismantled 39 domains and their associated servers as part of efforts to disrupt a network of online marketplaces originating from Pakistan.  The action, which took place on January 29, 2025, has been codenamed Operation Heart Blocker.  The vast array of sites in question peddled phishing toolkits and fraud-enabling tools and was operated by a group known as Saim Raza since at least 2020, which is also known as HeartSender.   These offerings were then used by transnational organized crime groups to target several victims in the United States as part of various business email compromise ( BEC ) schemes, leading to losses totaling over $3 million.  \"The Saim Raza-run websites operated as marketplaces that advertised and facilitated the sale of tools such as phishing kits, scam pages, and email extractors, often used to build and maintain fraud operations,\" the U.S. Department of Justice (DoJ) said .  \"N..."
    },
    {
        "title": "BeyondTrust Zero-Day Breach Exposed 17 SaaS Customers via Compromised API Key",
        "link": "https://thehackernews.com/2025/02/beyondtrust-zero-day-breach-exposes-17.html?m=1",
        "content": "BeyondTrust has revealed it completed an investigation into a recent cybersecurity incident that targeted some of the company's Remote Support SaaS instances by making use of a compromised API key.  The company said the breach involved 17 Remote Support SaaS customers and that the API key was used to enable unauthorized access by resetting local application passwords. The breach was first flagged on December 5, 2024.  \"The investigation determined that a zero-day vulnerability of a third-party application was used to gain access to an online asset in a BeyondTrust AWS account,\" the company said  this week.  \"Access to that asset then allowed the threat actor to obtain an infrastructure API key that could then be leveraged against a separate AWS account which operated Remote Support infrastructure.\"   The American access management company did not name the application that was explored to obtain the API key, but said the probe uncovered two separate flaws in its..."
    },
    {
        "title": "Meta Confirms Zero-Click WhatsApp Spyware Attack Targeting 90 Journalists, Activists",
        "link": "https://thehackernews.com/2025/02/meta-confirms-zero-click-whatsapp.html?m=1",
        "content": "Meta-owned WhatsApp on Friday said it disrupted a campaign that involved the use of spyware to target journalists and civil society members.  The campaign, which targeted around 90 members, involved the use of spyware from an Israeli company known as Paragon Solutions. The attackers were neutralized in December 2024.  In a statement  to The Guardian, the encrypted messaging app said it has reached out to affected users, stating it had \"high confidence\" that the users were targeted and \"possibly compromised.\" It's currently not known who is behind the campaign and for how long it took place.   The attack chain is said to be zero-click, meaning the deployment of the spyware occurs without requiring any user interaction. It's suspected to involve the distribution of a specially-crafted PDF file sent to individuals who were added to group chats on WhatsApp.  The company also revealed that it had sent Paragon a \"cease and desist\" letter and that it was..."
    },
    {
        "title": "Malvertising Scam Uses Fake Google Ads to Hijack Microsoft Advertising Accounts",
        "link": "https://thehackernews.com/2025/02/malvertising-scam-uses-fake-google-ads.html?m=1",
        "content": "Cybersecurity researchers have discovered a malvertising campaign that's targeting Microsoft advertisers with bogus Google ads that aim to take them to phishing pages that are capable of harvesting their credentials.  \"These malicious ads, appearing on Google Search, are designed to steal the login information of users trying to access Microsoft's advertising platform,\" Jérôme Segura, senior director of research at Malwarebytes, said  in a Thursday report.  The findings came a few weeks after the cybersecurity company exposed  a similar campaign that leveraged sponsored Google Ads to target individuals and businesses advertising via the search giant's advertising platform.  The latest set of attacks targets users who search for terms like \"Microsoft Ads\" on Google Search, hoping to trick them into clicking on malicious links served in the form of sponsored ads in the search results pages.  At the same time, the threat actors behind the campaign employ s..."
    }
]